/******************************************************************************
----------------本例程仅供学习使用，未经作者允许，不得用于其他用途。-----------
------------------------版权所有，仿冒必究！-----------------------------------
----------------1.开发环境:Arduino IDE-----------------------------------------
----------------2.测试使用开发板型号：Arduino Leonardo or Arduino UNO R3-------
----------------3.单片机使用晶振：16M------------------------------------------
----------------4.淘宝网址：Ilovemcu.taobao.com--------------------------------
----------------------------epic-mcu.taobao.com--------------------------------
----------------5.作者：神秘藏宝室---------------------------------------------
******************************************************************************/
#ifndef __DHT11_H__
#define __DHT11_H__

#include <Arduino.h>


class DHT11
{
public:
	DHT11(int pin);
	void DHT11_Init();
	unsigned char DHT11_Read_Byte();
	void DHT11_Read();

	unsigned char HUMI_Buffer_Int;
	unsigned char TEM_Buffer_Int;
private:
	int DHT11_DQ;
};

#endif
